package com.example.labarticles.fragments

import android.os.Bundle
import android.view.View
import androidx.fragment.app.Fragment
import androidx.navigation.fragment.findNavController
import androidx.recyclerview.widget.LinearLayoutManager
import androidx.recyclerview.widget.RecyclerView
import com.example.labarticles.Article
import com.example.labarticles.R
import com.example.labarticles.adapters.ArticleAdapter

class ArticlesListFragment : Fragment(R.layout.fragment_articles_list) {
    private lateinit var recyclerView: RecyclerView

    override fun onViewCreated(view: View, savedInstanceState: Bundle?) {
        super.onViewCreated(view, savedInstanceState)

        val articles = listOf<Article>(
                Article("Сковороди по 700 тисяч і барабани: київські освітяни на 3,5 мільйона подбали про шкільні укриття",
                        "Освітяни Дніпровського району столиці закупили для укриттів у закладах освіти високотехнологічні овочерізки та сковорідки, а також барабани для психологічного розвантаження дітей під час повітряних тривог на понад 3,5 мільйона гривень.",
                        "https://img.pravda.com/images/doc/d/8/d8be90b-gettyimages-477669135.jpg",
                        "Освітяни Дніпровського району столиці закупили для укриттів у закладах освіти високотехнологічні овочерізки та сковорідки, а також барабани для психологічного розвантаження дітей під час повітряних тривог на понад 3,5 мільйона гривень.\n" +
                                "\n" +
                                "Про це свідчать дані в системі онлайн-закупівель Prozorro.\n" +
                                "\n" +
                                "Сковорідки та кухонні комбайни на 2,7 мільйона\n" +
                                "\n" +
                                "Управління освіти Дніпровської районної в місті Києві державної адміністрації оголосило тендер на закупівлю 12 \"комплектів обладнання для обробки продуктів харчування в укриттях\" на понад 1,5 млн грн у грудні 2022 року. Тоді ж було підписано договір та, відповідно, закуплені товари.\n" +
                                "\n" +
                                "Для укриттів чиновники обрали овочерізки Robot Coupe CL50. Модель укомплектована:\n" +
                                "\n" +
                                "дисками-слайсерами 1 мм, 2 мм, 4 мм;\n" +
                                "диском-терткою 2 мм;\n" +
                                "диском для нарізки соломкою 2.5x2.5 мм;\n" +
                                "комплектом для нарізки кубиками 10x10x10 мм;\n" +
                                "диском картопля-фрі 10х10 мм;\n" +
                                "комплектом для очистки решіток для нарізки кубиків 5, 8 і 10 мм;\n" +
                                "набором для картопляного пюре 2мм;\n" +
                                "двошаровим тримачем для решіток, чистящим інструментом, воронкою для загрузки, тощо.\n"),

                Article("Кадиров знайшов свою \"праву руку\"",
                        "Глава Чечні Рамзан Кадиров стверджує, що депутат Держдуми і його \"права рука\" Адам Делімханов - \"живий-здоровий і навіть не поранений\".",
                        "https://img.pravda.com/images/doc/6/5/659a1f6-000.jpg",
                        "Глава Чечні Рамзан Кадиров стверджує, що депутат Держдуми і його \"права рука\" Адам Делімханов - \"живий-здоровий і навіть не поранений\".\n" +
                                "\n" +
                                "Джерело: Кадиров у своєму телеграм-каналі\n" +
                                "\n" +
                                "Деталі: Він переконує, що знав від самого початку: поранення Делімханова - \"фейкове вкидання\", однак вирішив \"підлити олії у вогонь\", щоб \"продемонструвати всім, насамперед українцям, до якої міри опустилися їхні засоби масової інформації\".\n" +
                                "\n" +
                                "Як доказ Кадиров опублікував фотографію, на якій він разом із Делімхановим сидить на травичці. Коментар до знімка каже, що Делімханов, Кадиров та інші \"герої Росії\" нібито продовжують працювати.При цьому жодних доказів, що це фото свіже, - немає.\n" +
                                "\n" +
                                "Що передувало: Раніше російські ЗМІ повідомили, що на території України дістав поранення депутат Держдуми і \"права рука\" глави Чечні Адам Делімханов. До того в мережі навіть з'явилася інформація про ліквідацію окупанта.\n" +
                                "\n" +
                                "Водночас Кадиров заявив, що він ніяк не може вийти на зв'язок із Делімхановим."),

                Article("Кличко вже не хоче перейменування вулиці Скоропадського на Омельченка: підтримав петицію",
                        "Київський міський голова Віталій Кличко не погодився з рішенням комісії Київради щодо перейменування столичної вулиці Павла Скоропадського на честь ексмера Олександра Омельченка, хоча на початку червня Київрада зареєструвала відповідний проєкт рішення за його авторства.",
                        "https://img.pravda.com/images/doc/9/0/90791e0-klitchko--1-.jpg",
                        "Київський міський голова Віталій Кличко не погодився з рішенням комісії Київради щодо перейменування столичної вулиці Павла Скоропадського на честь ексмера Олександра Омельченка, хоча на початку червня Київрада зареєструвала відповідний проєкт рішення за його авторства.\n" +
                                "\n" +
                                "Джерело: Кличко у Telegram\n" +
                                "\n" +
                                "Пряма мова Кличка: \"Сьогодні підписав, тобто підтримав петицію з вимогою не допустити перейменування вулиці Павла Скоропадського на честь колишнього міського голови столиці Олександра Омельченка\".\n" +
                                "\n" +
                                "Деталі: За його словами, перейменування будь-якої іншої вулиці на честь Омельченка буде повторно винесене на голосування в \"Києві цифровому\", як це рекомендувала одна з комісій Київради.\n" +
                                "\n" +
                                "Що було раніше: \n" +
                                "\n" +
                                "Передісторія: \n" +
                                "\n" +
                                "29 травня міський голова Віталій Кличко зареєстрував проєкт рішення Київради про перейменування вулиці Павла Скоропадського у Печерському районі Києва на вулицю Олександра Омельченка.\n" +
                                "Однак 74% киян, що голосували в застосунку \"Київ цифровий\", висловилися проти такого перейменування.\n" +
                                "Кличко аргументує необхідність перейменування тим, що внаслідок активної дерусифікації топонімів у Києві виявилося дві вулиці Павла Скоропадського. \n" +
                                "14 червня стало відомо, що комісія Київради з місцевого самоврядування підтримала проєкт рішення про перейменування вулиці Павла Скоропадського на честь ексмера Олександра Омельченка. "),

                Article("Колишнього суддю Чауса засуджено до 10 років позбавлення волі ",
                        "Вищий антикорупційний суд визнав колишнього суддю Дніпровського райсуду Києва Миколу Чауса винним у хабарництві й засудив його до 10 років ув'язнення з конфіскацією майна.",
                        "https://img.pravda.com/images/doc/7/0/7011f32-chaus-sud--screenshot--400.jpg",
                        "Вищий антикорупційний суд визнав колишнього суддю Дніпровського райсуду Києва Миколу Чауса винним у хабарництві й засудив його до 10 років ув'язнення з конфіскацією майна.\n" +
                                "\n" +
                                "Джерело: Вищий антикорупційний суд, Спеціалізована антикорупційна прокуратура, \"Центр протидії корупції\"\n" +
                                "\n" +
                                "Деталі: Колегія ВАКС 14 червня оголосила вирок щодо колишнього судді Дніпровського районного суду Києва Миколи Чауса, викритого на вимаганні та одержанні неправомірної вигоди у 150 тисяч дол США 7 років тому (понад 3,7 млн грн за курсом НБУ станом на той час).\n" +
                                "\n" +
                                "Суддя отримав 10 років ув'язнення з конфіскацією майна таз позбавленням права обіймати певні посади строком 3 роки. \n" +
                                "\n" +
                                "Чауса затримали одразу в залі суду. "),

                Article("Парламент Люксембургу визнав Голодомор геноцидом українського народу",
                        "Палата депутатів Люксембургу у вівторок ухвалила резолюцію про визнання Голодомору 1932-1933 років геноцидом українсього народу.",
                        "https://img.pravda.com/images/doc/a/9/a9060f7-holodomor--1-.jpg",
                        "Палата депутатів Люксембургу у вівторок ухвалила резолюцію про визнання Голодомору 1932-1933 років геноцидом українсього народу.\n" +
                                "\n" +
                                "Про це повідомляє \"Європейська правда\".\n" +
                                "\n" +
                                "Текст ухваленої резолюції про визнання Голодомору в Україні геноцидом на сайті парламенту Люксембургу наразі не наводиться.\n" +
                                "\n" +
                                "Міністр закордонних справ Дмитро Кулеба привітав історичне рішення люксембурзьких депутатів.\n" +
                                "\n" +
                                "\"Цей крок вшановує мільйони жертв та відновлює історичну справедливість. Міжнародне визнання Голодомору геноцидом продовжує зростати\", – написав він у Twitter."),
                )


        recyclerView = view.findViewById(R.id.recycler_view)
        val adapter = ArticleAdapter { article ->
            val action = ArticlesListFragmentDirections.actionArticlesListFragmentToArticleDetailsFragment(article)
            findNavController().navigate(action)
        }
        recyclerView.adapter = adapter
        recyclerView.layoutManager = LinearLayoutManager(context)

        adapter.data = articles
    }
}
